arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/src/flexcan/fsl_flexcan_hal.c
/*******************************************************************************
 * Private Functions
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_HAL_GetMsgBuffRegion
 * Description   : Returns the start of a MB area, based on its index.
 *
 *END**************************************************************************/
volatile uint32_t* FLEXCAN_HAL_GetMsgBuffRegion(
        CAN_Type * base,
        uint32_t msgBuffIdx)
{
    uint8_t payload_size = FLEXCAN_HAL_GetPayloadSize(base);
    uint8_t arbitration_field_size = 8U;

    uint8_t mb_size = payload_size + arbitration_field_size;
    /* Multiply the MB index by the MB size (in words) */
    uint8_t mb_index = msgBuffIdx * (mb_size >> 2);

    return &(base->RAMn[mb_index]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name: FLEXCAN_HAL_ComputeDLCValue
 * Description  : Computes the DLC field value, given a payload size (in bytes).
 *
 *END**************************************************************************/
uint8_t FLEXCAN_HAL_ComputeDLCValue(
        uint8_t payloadSize)
{
    if (payloadSize <= 8)
        return payloadSize;
    else if ((payloadSize > 8) && (payloadSize <= 12))
        return CAN_DLC_VALUE_12_BYTES;
    else if ((payloadSize > 12) && (payloadSize <= 16))
        return CAN_DLC_VALUE_16_BYTES;
    else if ((payloadSize > 16) && (payloadSize <= 20))
        return CAN_DLC_VALUE_20_BYTES;
    else if ((payloadSize > 20) && (payloadSize <= 24))
        return CAN_DLC_VALUE_24_BYTES;
    else if ((payloadSize > 24) && (payloadSize <= 32))
        return CAN_DLC_VALUE_32_BYTES;
    else if ((payloadSize > 32) && (payloadSize <= 48))
        return CAN_DLC_VALUE_48_BYTES;
    else if ((payloadSize > 48) && (payloadSize <= 64))
        return CAN_DLC_VALUE_64_BYTES;

    /* The argument is not a valid payload size */
    return 0xFF;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_HAL_ComputePayloadSize
 * Description   : Computes the maximum payload size (in bytes), given a DLC
 * field value.
 *
 *END**************************************************************************/
uint8_t FLEXCAN_HAL_ComputePayloadSize(
        uint8_t dlcValue)
{
    if (dlcValue <= 8)
        return dlcValue;

    switch (dlcValue) {
    case CAN_DLC_VALUE_12_BYTES:
        return 12;
    case CAN_DLC_VALUE_16_BYTES:
        return 16;
    case CAN_DLC_VALUE_20_BYTES:
        return 20;
    case CAN_DLC_VALUE_24_BYTES:
        return 24;
    case CAN_DLC_VALUE_32_BYTES:
        return 32;
    case CAN_DLC_VALUE_48_BYTES:
        return 48;
    case CAN_DLC_VALUE_64_BYTES:
        return 64;
    default:
        /* The argument is not a valid DLC value */
        return 0xFF;
    }
}

/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_HAL_Enable
 * Description   : Enable FlexCAN module.
 * This function will enable FlexCAN module.
 *
 *END**************************************************************************/
flexcan_status_t FLEXCAN_HAL_Enable(CAN_Type * base)
{
    /* Check for low power mode*/
    if((BITBAND_ACCESS32(&(base->MCR), CAN_MCR_LPMACK_SHIFT))==0x1)
    {
        /* Enable clock*/
         BITBAND_ACCESS32(&(base->MCR), CAN_MCR_MDIS_SHIFT) = (0x0);
         BITBAND_ACCESS32(&(base->MCR), CAN_MCR_FRZ_SHIFT) = (0x0);
         BITBAND_ACCESS32(&(base->MCR), CAN_MCR_HALT_SHIFT) = (0x0);
        /* Wait until enabled*/
        while (BITBAND_ACCESS32( &(base->MCR), CAN_MCR_LPMACK_SHIFT)!=0x0){}
    }

    return FLEXCAN_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_HAL_Disable
 * Description   : Disable FlexCAN module.
 * This function will disable FlexCAN module.
 *
 *END**************************************************************************/
flexcan_status_t FLEXCAN_HAL_Disable(CAN_Type * base)
{
    /* To access the memory mapped registers*/
    /* Entre disable mode (hard reset).*/
    if((BITBAND_ACCESS32(&(base->MCR), CAN_MCR_MDIS_SHIFT)) == 0x0)
    {
        /* Clock disable (module)*/
        BITBAND_ACCESS32(&(base->MCR), CAN_MCR_MDIS_SHIFT) = (0x1);

        /* Wait until disable mode acknowledged*/
        while (!(BITBAND_ACCESS32(&(base->MCR), CAN_MCR_LPMACK_SHIFT))){}
    }

    return FLEXCAN_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_HAL_SelectClock
 * Description   : Select FlexCAN clock source.
 * This function will select either internal bus clock or external clock as
 * FlexCAN clock source.
 *
 *END**************************************************************************/
flexcan_status_t FLEXCAN_HAL_SelectClock(
    CAN_Type * base,
    flexcan_clk_source_t clk)
{
    BITBAND_ACCESS32(&(base->CTRL1), CAN_CTRL1_CLKSRC_SHIFT) = (clk);
    return FLEXCAN_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_HAL_Init
 * Description   : Initialize FlexCAN module.
 * This function will reset FlexCAN module, set maximum number of message
 * buffers, initialize all message buffers as inactive, enable RX FIFO
 * if needed, mask all mask bits, and disable all MB interrupts.
 *
 *END**************************************************************************/
flexcan_status_t FLEXCAN_HAL_Init(CAN_Type * base)
{

    /* Reset the FLEXCAN*/
    BITBAND_ACCESS32(&(base->MCR), CAN_MCR_SOFTRST_SHIFT) = (0x1);

    /* Wait for reset cycle to complete*/
    while (BITBAND_ACCESS32(&(base->MCR), CAN_MCR_SOFTRST_SHIFT)){}

    /* Set Freeze, Halt*/
    FLEXCAN_HAL_EnterFreezeMode(base);

