arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/src/flexcan/fsl_flexcan_hal.c
    /* Compute the value of the DLC field */
    dlc_value = FLEXCAN_HAL_ComputeDLCValue(cs->dataLen);

    /* Copy user's buffer into the message buffer data area */
    if (msgData != NULL)
    {
        uint8_t payload_size = FLEXCAN_HAL_ComputePayloadSize(dlc_value);
        for (databyte = 0; databyte < cs->dataLen; databyte++)
        {
            flexcan_mb_data[FLEXCAN_SWAP_BYTES_IN_WORD_INDEX(databyte)] =  msgData[databyte];
        }
        /* Add padding, if needed */
        for (databyte = cs->dataLen; databyte < payload_size; databyte++)
        {
            flexcan_mb_data[FLEXCAN_SWAP_BYTES_IN_WORD_INDEX(databyte)] = cs->fd_padding;
        }
    }

    /* Clean up the arbitration field area */
    *flexcan_mb = 0;
    *flexcan_mb_id = 0;
    
    /* Set the ID according the format structure */
    if (cs->msgIdType == FLEXCAN_MSG_ID_EXT)
    {
        /* ID [28-0]*/
        *flexcan_mb_id &= ~(CAN_ID_STD_MASK | CAN_ID_EXT_MASK);
        *flexcan_mb_id |= (msgId & (CAN_ID_STD_MASK | CAN_ID_EXT_MASK));
      
        /* Set IDE*/
        flexcan_mb_config |= CAN_CS_IDE_MASK;

        /* Clear SRR bit*/
        flexcan_mb_config &= ~CAN_CS_SRR_MASK;
    }
    else if(cs->msgIdType == FLEXCAN_MSG_ID_STD)
    {
        /* ID[28-18]*/
        *flexcan_mb_id &= ~CAN_ID_STD_MASK;
        *flexcan_mb_id |= (msgId << CAN_ID_STD_SHIFT) & CAN_ID_STD_MASK;

        /* make sure IDE and SRR are not set*/
        flexcan_mb_config &= ~(CAN_CS_IDE_MASK | CAN_CS_SRR_MASK);
    }
    else
    {
        return FLEXCAN_STATUS_INVALID_ARGUMENT;
    }

    /* Set the length of data in bytes */
    flexcan_mb_config &= ~CAN_CS_DLC_MASK;
    flexcan_mb_config |= (dlc_value << CAN_CS_DLC_SHIFT) & CAN_CS_DLC_MASK;

    /* Set MB CODE */
    if (cs->code != FLEXCAN_TX_NOT_USED)
    {
        if (cs->code == FLEXCAN_TX_REMOTE)
        {
            /* Set RTR bit */
            flexcan_mb_config |= CAN_CS_RTR_MASK;
            cs->code = FLEXCAN_TX_DATA;
        }

        /* Reset the code */
        flexcan_mb_config &= ~CAN_CS_CODE_MASK;

        /* Set the code */
        if (cs->fd_enable == 1)
        {
            flexcan_mb_config |= ((cs->code << CAN_CS_CODE_SHIFT) & CAN_CS_CODE_MASK) | CAN_MB_EDL_MASK;
        }
        else
        {
            flexcan_mb_config |= (cs->code << CAN_CS_CODE_SHIFT) & CAN_CS_CODE_MASK;
        }  

        if (cs->enable_brs == 1)
        {
            flexcan_mb_config |= CAN_MB_BRS_MASK;
        }

        *flexcan_mb |= flexcan_mb_config;
    }

    return FLEXCAN_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_HAL_SetMbRx
 * Description   : Configure a message buffer for receiving.
 * This function will first check if RX FIFO is enabled. If RX FIFO is enabled,
 * the function will make sure if the MB requested is not occupied by RX FIFO
 * and ID filter table. Then this function will configure the message buffer as
 * required for receiving.
 *
 *END**************************************************************************/
flexcan_status_t FLEXCAN_HAL_SetRxMsgBuff(
    CAN_Type * base,
    uint32_t msgBuffIdx,
    flexcan_msgbuff_code_status_t *cs,
    uint32_t msgId)
{
    uint32_t val1, val2 = 1;

    volatile uint32_t *flexcan_mb = FLEXCAN_HAL_GetMsgBuffRegion(base, msgBuffIdx);
    volatile uint32_t *flexcan_mb_id   = flexcan_mb + 1;

    if (msgBuffIdx >= (((base->MCR) & CAN_MCR_MAXMB_MASK) >> CAN_MCR_MAXMB_SHIFT))
    {
        return FLEXCAN_STATUS_OUT_OF_RANGE;
    }

    /* Check if RX FIFO is enabled */
    if (BITBAND_ACCESS32(&(base->MCR), CAN_MCR_RFEN_SHIFT))
    {
        /* Get the number of RX FIFO Filters*/
        val1 = (((base->CTRL2) & CAN_CTRL2_RFFN_MASK) >> CAN_CTRL2_RFFN_SHIFT);
        /* Get the number if MBs occupied by RX FIFO and ID filter table*/
        /* the Rx FIFO occupies the memory space originally reserved for MB0-5*/
        /* Every number of RFFN means 8 number of RX FIFO filters*/
        /* and every 4 number of RX FIFO filters occupied one MB*/
        val2 = RxFifoOcuppiedLastMsgBuff(val1);

        if (msgBuffIdx <= val2)
        {
            return FLEXCAN_STATUS_INVALID_ARGUMENT;
        }
    }

    /* Clean up the arbitration field area */
    *flexcan_mb = 0;
    *flexcan_mb_id = 0;

    /* Set the ID according the format structure */
    if (cs->msgIdType == FLEXCAN_MSG_ID_EXT)
    {
        /* Set IDE */
        *flexcan_mb |= CAN_CS_IDE_MASK;

        /* Clear SRR bit */
        *flexcan_mb &= ~CAN_CS_SRR_MASK;

        /* ID [28-0] */
        *flexcan_mb_id &= ~(CAN_ID_STD_MASK | CAN_ID_EXT_MASK);
        *flexcan_mb_id |= (msgId & (CAN_ID_STD_MASK | CAN_ID_EXT_MASK));
    }
    else if(cs->msgIdType == FLEXCAN_MSG_ID_STD)
    {
        /* Make sure IDE and SRR are not set */
        *flexcan_mb &= ~(CAN_CS_IDE_MASK | CAN_CS_SRR_MASK);

        /* ID[28-18] */
        *flexcan_mb_id &= ~CAN_ID_STD_MASK;
        *flexcan_mb_id |= (msgId << CAN_ID_STD_SHIFT) & CAN_ID_STD_MASK;
    }
    else
    {
        return FLEXCAN_STATUS_INVALID_ARGUMENT;
    }
 
    /* Set MB CODE */
    if (cs->code != FLEXCAN_RX_NOT_USED)
    {
         *flexcan_mb &= ~CAN_CS_CODE_MASK;
         *flexcan_mb |= (cs->code << CAN_CS_CODE_SHIFT) & CAN_CS_CODE_MASK;
    }

    return FLEXCAN_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_HAL_GetMsgBuff
 * Description   : Get a message buffer field values.
 * This function will first check if RX FIFO is enabled. If RX FIFO is enabled,
 * the function will make sure if the MB requested is not occupied by RX FIFO
 * and ID filter table. Then this function will get the message buffer field
 * values and copy the MB data field into user's buffer.
 *
 *END**************************************************************************/
flexcan_status_t FLEXCAN_HAL_GetMsgBuff(
    CAN_Type * base,
    uint32_t msgBuffIdx,
    flexcan_msgbuff_t *msgBuff)
{
    uint32_t i;
    uint32_t val1, val2 = 1;

