arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/src/flexcan/fsl_flexcan_hal.c
    volatile uint32_t *flexcan_mb = FLEXCAN_HAL_GetMsgBuffRegion(base, msgBuffIdx);
    volatile uint32_t *flexcan_mb_id   = flexcan_mb + 1;
    volatile uint8_t  *flexcan_mb_data = (uint8_t *)(flexcan_mb + 2);

    uint32_t flexcan_mb_dlc_value = ((*flexcan_mb) & CAN_CS_DLC_MASK) >> 16;
    uint8_t payload_size = FLEXCAN_HAL_ComputePayloadSize(flexcan_mb_dlc_value);

    if (msgBuffIdx >= (((base->MCR) & CAN_MCR_MAXMB_MASK) >> CAN_MCR_MAXMB_SHIFT))
    {
        return FLEXCAN_STATUS_OUT_OF_RANGE;
    }

    /* Check if RX FIFO is enabled */
    if (BITBAND_ACCESS32(&(base->MCR), CAN_MCR_RFEN_SHIFT))
    {
        /* Get the number of RX FIFO Filters*/
        val1 = (((base->CTRL2) & CAN_CTRL2_RFFN_MASK) >> CAN_CTRL2_RFFN_SHIFT);
        /* Get the number if MBs occupied by RX FIFO and ID filter table*/
        /* the Rx FIFO occupies the memory space originally reserved for MB0-5*/
        /* Every number of RFFN means 8 number of RX FIFO filters*/
        /* and every 4 number of RX FIFO filters occupied one MB*/
        val2 = RxFifoOcuppiedLastMsgBuff(val1);

        if (msgBuffIdx <= val2)
        {
            return FLEXCAN_STATUS_INVALID_ARGUMENT;
        }
    }

    /* Get a MB field values */
    msgBuff->cs = *flexcan_mb;
    if ((msgBuff->cs) & CAN_CS_IDE_MASK)
    {
        msgBuff->msgId = (*(volatile uint32_t*)(flexcan_mb_id));
    }
    else
    {
        msgBuff->msgId = (*(volatile uint32_t*)(flexcan_mb_id)) >> CAN_ID_STD_SHIFT;
    }

    /* Copy MB data field into user's buffer */
    for (i = 0 ; i < payload_size ; i++)
    {
        msgBuff->data[i] = flexcan_mb_data[FLEXCAN_SWAP_BYTES_IN_WORD_INDEX(i)];
    }

    return FLEXCAN_STATUS_SUCCESS;
}

/** Arvind added */
/*FUNCTION**********************************************************************
 * 
 * Function Name : FLEXCAN_HAL_GetMailBox
 * Description   : Get a message buffer field values.
 * This function will first check if RX FIFO is enabled. If RX FIFO is enabled,
 * the function will make sure if the MB requested is not occupied by RX FIFO
 * and ID filter table. Then this function will get the message buffer field
 * values and copy the MB data field into user's buffer.
 *
 *END**************************************************************************/
flexcan_status_t FLEXCAN_HAL_GetMailBox(
    CAN_Type * base,
    uint32_t msgBuffIdx,
    flexcan_msgbuff_t *msgBuff,
    mailBox_t *mailBox)
{
    uint32_t i;
    uint32_t val1, val2 = 1;

    volatile uint32_t *flexcan_mb = FLEXCAN_HAL_GetMsgBuffRegion(base, msgBuffIdx);
    volatile uint32_t *flexcan_mb_id   = flexcan_mb + 1;
    volatile uint8_t  *flexcan_mb_data = (uint8_t *)(flexcan_mb + 2);

    uint32_t flexcan_mb_dlc_value = ((*flexcan_mb) & CAN_CS_DLC_MASK) >> 16;
    uint8_t payload_size = FLEXCAN_HAL_ComputePayloadSize(flexcan_mb_dlc_value);

    if (msgBuffIdx >= (((base->MCR) & CAN_MCR_MAXMB_MASK) >> CAN_MCR_MAXMB_SHIFT))
    {
        return FLEXCAN_STATUS_OUT_OF_RANGE;
    }

    /* Check if RX FIFO is enabled */
    if (BITBAND_ACCESS32(&(base->MCR), CAN_MCR_RFEN_SHIFT))
    {
        /* Get the number of RX FIFO Filters*/
        val1 = (((base->CTRL2) & CAN_CTRL2_RFFN_MASK) >> CAN_CTRL2_RFFN_SHIFT);
        /* Get the number if MBs occupied by RX FIFO and ID filter table*/
        /* the Rx FIFO occupies the memory space originally reserved for MB0-5*/
        /* Every number of RFFN means 8 number of RX FIFO filters*/
        /* and every 4 number of RX FIFO filters occupied one MB*/
        val2 = RxFifoOcuppiedLastMsgBuff(val1);

        if (msgBuffIdx <= val2)
        {
            return FLEXCAN_STATUS_INVALID_ARGUMENT;
        }
    }

    /* Get paylod from MB */
    mailBox->mb_dlc = payload_size;
    
    /* Get a MB field values */
    msgBuff->cs = *flexcan_mb;
    
    if ((msgBuff->cs) & CAN_CS_IDE_MASK)
    {
       msgBuff->msgId = (*(volatile uint32_t*)(flexcan_mb_id));
       mailBox->mb_msgId = msgBuff->msgId;
    }
    else
    {
        msgBuff->msgId = (*(volatile uint32_t*)(flexcan_mb_id)) >> CAN_ID_STD_SHIFT;
        mailBox->mb_msgId = msgBuff->msgId;
    }

    /* Copy MB data field into user's buffer */
    for (i = 0 ; i < payload_size ; i++)
    {
       msgBuff->data[i] = flexcan_mb_data[FLEXCAN_SWAP_BYTES_IN_WORD_INDEX(i)];
    }

    mailBox->mb_payload = msgBuff->data;
    
    return FLEXCAN_STATUS_SUCCESS;
}

/** End */

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_HAL_LockRxMsgBuff
 * Description   : Lock the RX message buffer.
 * This function will the RX message buffer.
 *
 *END**************************************************************************/
flexcan_status_t FLEXCAN_HAL_LockRxMsgBuff(
    CAN_Type * base,
    uint32_t msgBuffIdx)
{
    volatile uint32_t *flexcan_mb = FLEXCAN_HAL_GetMsgBuffRegion(base, msgBuffIdx);
    
    uint32_t tmp = 1;

    if (msgBuffIdx >= (((base->MCR) & CAN_MCR_MAXMB_MASK) >> CAN_MCR_MAXMB_SHIFT))
    {
        return (FLEXCAN_STATUS_OUT_OF_RANGE);
    }

    /* Lock the mailbox */
    if(tmp)
    {
        tmp = *flexcan_mb;
    }

    return FLEXCAN_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_HAL_EnableRxFifo
 * Description   : Enable Rx FIFO feature.
 * This function will enable the Rx FIFO feature.
 *
 *END**************************************************************************/
void FLEXCAN_HAL_EnableRxFifo(CAN_Type * base, uint32_t numOfFilters)
{
    uint32_t i;
    uint32_t maxNumMb;
    /* Set Freeze mode*/
    FLEXCAN_HAL_EnterFreezeMode(base);
    /* Enable RX FIFO*/
    BITBAND_ACCESS32(&(base->MCR), CAN_MCR_RFEN_SHIFT) = (0x1);
    /* Set the number of the RX FIFO filters needed*/
    (base->CTRL2) = (((base->CTRL2) & ~(CAN_CTRL2_RFFN_MASK)) | (((uint32_t)(((uint32_t)(numOfFilters))<<CAN_CTRL2_RFFN_SHIFT))&CAN_CTRL2_RFFN_MASK) );
    /* RX FIFO global mask*/
    (base->RXFGMASK) = (((uint32_t)(((uint32_t)(CAN_RXFGMASK_FGM_MASK)) << CAN_ID_EXT_SHIFT)) & (CAN_ID_STD_MASK | CAN_ID_EXT_MASK));
    maxNumMb = (((base->MCR) & CAN_MCR_MAXMB_MASK) >> CAN_MCR_MAXMB_SHIFT);
    for (i = 0; i < maxNumMb; i++)
    {
        /* RX individual mask*/
        ((base)->RXIMR[i]) = (((uint32_t)(((uint32_t)(CAN_RXIMR_MI_MASK)) << CAN_ID_EXT_SHIFT)) & (CAN_ID_STD_MASK | CAN_ID_EXT_MASK));
    }

    /* De-assert Freeze Mode*/
    FLEXCAN_HAL_ExitFreezeMode(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_HAL_DisableRxFifo
 * Description   : Disable Rx FIFO feature.
 * This function will disable the Rx FIFO feature.
 *
 *END**************************************************************************/
void FLEXCAN_HAL_DisableRxFifo(CAN_Type * base)
{
    /* Set Freeze mode*/
    FLEXCAN_HAL_EnterFreezeMode(base);
    /* Disable RX FIFO*/
    BITBAND_ACCESS32(&(base->MCR), CAN_MCR_RFEN_SHIFT) = (0x0);

    /* De-assert Freeze Mode*/
    FLEXCAN_HAL_ExitFreezeMode(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_HAL_SetRxFifoFilterNum
 * Description   : Set the number of Rx FIFO filters.
 * This function will define the number of Rx FIFO filters.
 *
 *END**************************************************************************/
void FLEXCAN_HAL_SetRxFifoFilterNum(
    CAN_Type * base,
    uint32_t number)
{
    /* Set Freeze mode*/
    FLEXCAN_HAL_EnterFreezeMode(base);

    /* Set the number of RX FIFO ID filters*/
    (base->CTRL2) = (((base->CTRL2) & ~(CAN_CTRL2_RFFN_MASK)) | (((uint32_t)(((uint32_t)(number))<<CAN_CTRL2_RFFN_SHIFT))&CAN_CTRL2_RFFN_MASK));

    /* De-assert Freeze Mode*/
    FLEXCAN_HAL_ExitFreezeMode(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_HAL_SetMaxMsgBuffNum
 * Description   : Set the number of the last Message Buffers.
 * This function will define the number of the last Message Buffers
 *
*END**************************************************************************/
void FLEXCAN_HAL_SetMaxMsgBuffNum(
    CAN_Type * base,
    uint32_t maxMsgBuffNum)
{
    uint8_t msgBuffIdx;
    uint32_t databyte;

    /* Set Freeze mode*/
    FLEXCAN_HAL_EnterFreezeMode(base);

    /* Set the maximum number of MBs*/
    base->MCR = (base->MCR & ~CAN_MCR_MAXMB_MASK) | ((maxMsgBuffNum << CAN_MCR_MAXMB_SHIFT) & CAN_MCR_MAXMB_MASK);

    /* Initialize all message buffers as inactive*/
    uint8_t can_real_payload = FLEXCAN_HAL_GetPayloadSize(base);
    for (msgBuffIdx = 0; msgBuffIdx < maxMsgBuffNum; msgBuffIdx++)
    {
        volatile uint32_t *flexcan_mb = FLEXCAN_HAL_GetMsgBuffRegion(base, msgBuffIdx);
        volatile uint32_t *flexcan_mb_id   = flexcan_mb + 1;
        volatile uint8_t  *flexcan_mb_data = (uint8_t *)(flexcan_mb + 2);
        
