arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/src/flexcan/fsl_flexcan_hal.c
    FLEXCAN_HAL_ExitFreezeMode(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_HAL_IsFDEnabled
 * Description   : Checks if the Flexible Data rate feature is enabled.
 *
 *END**************************************************************************/
bool FLEXCAN_HAL_IsFDEnabled(CAN_Type * base)
{
    return (bool) BITBAND_ACCESS32(&(base->MCR), CAN_MCR_FDEN_SHIFT);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_HAL_SetPayloadSize
 * Description   : Sets the payload size of the MBs.
 *
 *END**************************************************************************/
flexcan_status_t FLEXCAN_HAL_SetPayloadSize(
    CAN_Type * base,
    flexcan_fd_payload_size_t payloadSize)
{
    uint32_t tmp;

    /* If FD is not enabled, only 8 bytes payload is supported */
    if (!FLEXCAN_HAL_IsFDEnabled(base) && (payloadSize == FLEXCAN_PAYLOAD_SIZE_8))
    {
        return FLEXCAN_STATUS_SUCCESS;
    }
    if (!FLEXCAN_HAL_IsFDEnabled(base) && (payloadSize != FLEXCAN_PAYLOAD_SIZE_8))
    {
        return FLEXCAN_STATUS_UNKNOWN_PROPERTY;
    }

    FLEXCAN_HAL_EnterFreezeMode(base);

    tmp = base->FDCTRL;
    tmp &= ~(CAN_FDCTRL_MBDSR0_MASK | CAN_FDCTRL_MBDSR1_MASK);
    tmp |= payloadSize << CAN_FDCTRL_MBDSR0_SHIFT;
    tmp |= payloadSize << CAN_FDCTRL_MBDSR1_SHIFT;

    base->FDCTRL = tmp;

    FLEXCAN_HAL_ExitFreezeMode(base);

    return FLEXCAN_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_HAL_GetPayloadSize
 * Description   : Returns the payload size of the MBs (in bytes).
 *
 *END**************************************************************************/
uint8_t FLEXCAN_HAL_GetPayloadSize(CAN_Type * base)
{
    flexcan_fd_payload_size_t payloadSize;

    /* The standard payload size is 8 bytes */
    if (!FLEXCAN_HAL_IsFDEnabled(base))
    {
        return 8U;
    }

    payloadSize = (flexcan_fd_payload_size_t) 
        ((base->FDCTRL & CAN_FDCTRL_MBDSR0_MASK) >> CAN_FDCTRL_MBDSR0_SHIFT);
    return (1 << (payloadSize + 3));
}

/*******************************************************************************
 * EOF
 ******************************************************************************/
